<template>
  <div class="ly-emotion">
    <slot />
  </div>
</template>

<script>
export default {
  name: 'LyEmotion',
  mounted() {
    const name = this.$el.innerHTML;
    // const list = ['微笑', '撇嘴', '色', '发呆', '得意', '流泪', '害羞', '闭嘴', '睡', '大哭', '尴尬', '发怒', '调皮', '呲牙', '惊讶', '难过', '酷', '冷汗', '抓狂', '吐', '偷笑', '可爱', '白眼', '傲慢', '饥饿', '困', '惊恐', '流汗', '憨笑', '大兵', '奋斗', '咒骂', '疑问', '嘘', '晕', '折磨', '衰', '骷髅', '敲打', '再见', '擦汗', '抠鼻', '鼓掌', '糗大了', '坏笑', '左哼哼', '右哼哼', '哈欠', '鄙视', '委屈', '快哭了', '阴险', '亲亲', '吓', '可怜', '菜刀', '西瓜', '啤酒', '篮球', '乒乓', '咖啡', '饭', '猪头', '玫瑰', '凋谢', '示爱', '爱心', '心碎', '蛋糕', '闪电', '炸弹', '刀', '足球', '瓢虫', '便便', '月亮', '太阳', '礼物', '拥抱', '强', '弱', '握手', '胜利', '抱拳', '勾引', '拳头', '差劲', '爱你', 'NO', 'OK', '爱情', '飞吻', '跳跳', '发抖', '怄火', '转圈', '磕头', '回头', '跳绳', '挥手', '激动', '街舞', '献吻', '左太极', '右太极'];
    // const list = ['1f600', '1f62c', '1f601', '1f602', '1f923', '1f603', '1f604', '1f605',
    //   '1f606', '1f609', '1f60a', '1f642', '1f643', '263a', '1f60b', '1f60c',
    //   '1f60d', '1f970', '1f618', '1f617', '1f619', '1f61a', '1f61c', '1f92a',
    //   '1f928', '1f9d0', '1f61d', '1f61b', '1f911', '1f913', '1f60e', '1f929',
    //   '1f921', '1f920', '1f917', '1f60f', '1f636', '1f610', '1f611', '1f612',
    //   '1f644', '1f914', '1f925', '1f92d', '1f92b', '1f92c', '1f92f', '1f633',
    //   '1f61e', '1f61f', '1f620', '1f621', '1f614', '1f615', '1f641', '2639',
    //   '1f623', '1f616', '1f62b', '1f629', '1f97a', '1f624', '1f62e', '1f631',
    //   '1f628', '1f630', '1f62f', '1f626', '1f627', '1f622', '1f625', '1f924',
    //   '1f62a', '1f613', '1f975', '1f976', '1f62d', '1f635', '1f632', '1f910',
    //   '1f922', '1f927', '1f92e', '1f637', '1f912', '1f915', '1f974', '1f634',
    //   '1f4a4', '1f4a9', '1f608', '1f47f', '1f479', '1f47a', '1f480', '1f47b',
    //   '1f47d', '1f916', '1f63a', '1f638', '1f639', '1f63b', '1f63c', '1f63d'];
    // list.map(item => {
    //   const value = item;
    // });
    // const index = list.indexOf(name);
    // const imgHTML = `<img src="https://res.wx.qq.com/mpres/htmledition/images/icon/emotion/${index}.gif">`;
    const imgHTML = `<img style="width:20px;" src="https://twemoji.maxcdn.com/v/12.1.4/72x72/${name}.png">`;

    this.$nextTick(() => {
      this.$el.innerHTML = imgHTML;
    });
  }
};
</script>
<style scoped>
.ly-emotion {
  display: inline-block
}
.ly-static-emotion {
  width: 24px;
  height: 24px;
  display: inline-block;
}
</style>
